#include <iostream>
#include <string>
using namespace std;

/*Дано ціле число в діапазоні 16 – 49, що визначає вік людини (в роках).
 *Вивести рядок – словесний опис вказаного віку, забезпечивши правильне
 *узгодження числа із словом "рік", наприклад: 20 – "двадцять років",
 *32 – "тридцять два роки", 41 – "сорок один рік"*/

int main() {
    string units[3] = { "рік", "роки", "років" };
    string ageArr[34] = {
        "шіснадцять", "сімнадцять", "вісімнадцять", "дев'ятнадцять", "двадцять",
        "двадцять один", "двадцять два", "двадцять три", "двадцять чотири","двадцять п'ять",
        "двадцять шість", "двадцять сім", " двадцять вісім", "двадцять дев'ять", "тридцять",
        "тридцять один", "тридцять два", "тридцять три", "тридцять чотири", "тридцять п'ять",
        "тридцять шість", "тридцять сім", "тридцять вісім", "тридцять дев'ять", "сорок",
        "сорок один", "сорок два", "сорок три", "сорок чотири", "сорок п'ять",
        "сорок шість", "сорок сім", "сорок вісім", "сорок дев'ять"
    };
    string numS, description;
    int age, ageArray;

    try {
        cout << "Введіть вік (в діапазоні 16 - 49): ";
        cin >> numS;
        size_t pos;
        age = stoi(numS, &pos);
        if (pos < numS.size()|| age < 16 || age > 49) {
            throw 1;
        }
    }
    catch(...) {
        cout << "Ви ввели некоректні дані!";
        return 1;
    }

    int lastDigit = age % 10;
    ageArray = age - 16;

    switch(lastDigit) {
    case 1:
        description += units[0];
        break;
    case 2:
    case 3:
    case 4:
        description += units[1];
        break;
    default:
        description += units[2];
    }

    cout << ageArr[ageArray] << " " << description << endl;

    return 0;
}